Repository: Misha0501/trucks-management-backend
Catalog: TruckManagement/Resources/SharedResource.*.resx
Languages: bg, nl

# Test
source: test en
bg: тест бг
nl: test nl

# PartRideNotFound
source: Workday not found.
bg: Работният ден не е намерен.
nl: Werkdag niet gevonden

# CompanyIdRequired
source: companyId is required and cannot be empty
bg: Полето companyId е задължително и не може да бъде празно.
nl: companyId is verplicht en mag niet leeg zijn.

source: Invalid companyId format.
bg: Невалиден формат на companyId.
nl: Ongeldig formaat voor companyId.

# InvalidDateFormat
source: Invalid time format for Start or End.
bg: Невалиден формат на време за начало или край.
nl: Ongeldig tijdformaat voor Start of End.

source: User not authenticated.
bg: Потребителят не е автентикиран.
nl: Gebruiker is niet geauthenticeerd.

# FailedToCreatePartRide
source: Failed to create workday and upload files.
bg: Неуспешно създаване на работен ден и качване на файлове.
nl: Kan werkdag en bestanden niet aanmaken.

# DriverNotRegistered
source: You are not registered as a driver. Contact your administrator.
bg: Не сте регистриран като шофьор. Свържете се с вашия администратор.
nl: U bent niet geregistreerd als chauffeur. Neem contact op met uw beheerder.

# DriversCreateOwnPartRides
source: Drivers can only create PartRides for themselves.
bg: Шофьорите могат да създават работни дни само за себе си.
nl: Chauffeurs kunnen alleen ritten voor zichzelf aanmaken.

# DriverCompanyAssociationMismatch
source: You are not associated with this company.
bg: Не сте асоцииран с тази компания.
nl: U bent niet gekoppeld aan dit bedrijf.

# NoContactPersonProfile
source: No contact person profile found. You are not authorized.
bg: Не е намерен профил на контактно лице. Нямате разрешение за достъп.
nl: Geen contactpersoonprofiel gevonden. U bent niet geautoriseerd.

# NotAuthorizedCreatePartRideCompany
source: You are not authorized to create a PartRide for this company.
bg: Нямате разрешение да създавате работен ден за тази компания.
nl: U bent niet bevoegd om een rit voor dit bedrijf aan te maken.

# DriverNotFound
source: The specified driver does not exist.
bg: Посоченият шофьор не съществува.
nl: Chauffeur niet gevonden.

# DriverCompanyMismatch
source: Driver's company does not match the provided companyId.
bg: Компанията на шофьора не съвпада с подадения companyId.
nl: Het bedrijf van de chauffeur komt niet overeen met de opgegeven companyId.

# RideCompanyMismatch
source: Ride's company does not match the provided companyId.
bg: Компанията на пътуването не съвпада с подадения companyId.
nl: Het bedrijf van de rit komt niet overeen met de opgegeven companyId.

# CharterCompanyMismatch
source: Charter's company does not match the provided companyId.
bg: Компанията на чартъра не съвпада с подадения companyId.
nl: Het bedrijf van de charter komt niet overeen met de opgegeven companyId.

# ClientNotFound
source: The specified client does not exist.
bg: Посоченият клиент не съществува.
nl: De opgegeven klant bestaat niet.

# ClientCompanyMismatch
source: Client's company does not match the provided companyId.
bg: Компанията на клиента не съвпада с подадения companyId.
nl: Het bedrijf van de klant komt niet overeen met de opgegeven companyId.

# CarNotFound
source: The specified car does not exist.
bg: Посоченият автомобил не съществува.
nl: De opgegeven auto bestaat niet.

# CarCompanyMismatch
source: Car's company does not match the provided companyId.
bg: Компанията на автомобила не съвпада с подадения companyId.
nl: Het bedrijf van de auto komt niet overeen met de opgegeven companyId.

# InvalidGuidValue
source: Invalid GUID value ‘{0}’.
bg: Невалидна стойност на GUID: ‘{0}’.
nl: Ongeldige GUID-waarde ‘{0}’.

source: Invalid PartRide ID format.
bg: Невалиден формат на PartRide ID.

# PartRideInDisputeCannotEdit
source: This workday is currently under dispute and can’t be edited until resolved.
bg: Този работен ден в момента е в спор и не може да бъде редактиран, докато не бъде решен.

# DriversEditOwnPartRides
source: Drivers can only edit their own PartRides.
bg: Шофьорите могат да редактират само своите работни дни.

# NotAuthorizedForCompany
source: You are not authorized for the specified company.
bg: Нямате разрешение за посочената компания.

# RideNotFound
source: The specified ride does not exist.
bg: Посоченото пътуване не съществува.

# CharterNotFound
source: The specified charter does not exist.
bg: Посоченият чартър не съществува.

# HoursCodeIdRequired
source: HoursCodeId is required for calculation.
bg: Полето HoursCodeId е задължително за изчисления.

# HoursCodeNotFound
source: The specified hours code does not exist.
bg: Посоченият код за часове не съществува.

# HoursOptionNotFound
source: The specified hours option does not exist.
bg: Посочената опция за часове не съществува.

# FailedToUpdatePartRide
source: An unexpected error occurred while updating the workday.
bg: Възникна неочаквана грешка при обновяване на работния ден.

# TempFileNotFound
source: File was not found in temporary storage for ID: {0}.
bg: Файлът не беше намерен във временната директория за ID: {0}.
